In [2]:
import pandas as pd

df = pd.read_csv("Datasets/Salaries.csv")
first_5 = df.head()
last_10 = df.tail(10)

print(first_5)

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [3]:
salaries_only = df["salary"]
ranks_only = df["rank"]
print(salaries_only.head())

0    186960
1     93000
2    110515
3    131205
4    104800
Name: salary, dtype: int64

In [4]:
max_salariy = salaries_only.max()
mean_salariy = round(salaries_only.mean(), 2)
print(f"Mean salary: {mean_salariy}\nMax salary: {max_salariy}")

Mean salary: 108023.78
Max salary: 186960

In [5]:
salary_sex = df[["sex", "salary"]]
grouped_df = salary_sex.groupby(["sex"])
round(grouped_df.mean(),3)

            salary
sex
Female  101002.410
Male    115045.154

In [6]:
flights = pd.read_csv("Datasets/flights.csv")
flights[['air_time', 'dep_delay']].agg(['min', 'mean', 'max'])

       air_time   dep_delay
min    20.00000   -43.00000
mean  150.68646    12.63907
max   695.00000  1301.00000

In [7]:
# generate pandas dataset with 10 people with id last name name and role
people = pd.DataFrame({
    "id": range(1, 11),
    "last_name": ["Doe", "Smith", "Johnson", "Brown", "Williams", "Jones", "Garcia", "Miller", "Davis", "Rodriguez"],
    "name": ["John", "Jane", "Robert", "Michael", "William", "David", "Maria", "Richard", "Mary", "Linda"],
    "role": ["Engineer", "Manager", "Director", "CEO", "CTO", "CFO", "COO", "CIO", "CMO", "CDO"]
})

grades = pd.DataFrame({ "id": range(1, 11), "grade": [5, 4, 3, 2, 1, 5, 4, 3, 2, 1]})

# merge the two datasets
people_grades = pd.merge(people, grades, on="id")
people_grades

   id  last_name     name      role  grade
0   1        Doe     John  Engineer      5
1   2      Smith     Jane   Manager      4
2   3    Johnson   Robert  Director      3
3   4      Brown  Michael       CEO      2
4   5   Williams  William       CTO      1
5   6      Jones    David       CFO      5
6   7     Garcia    Maria       COO      4
7   8     Miller  Richard       CIO      3
8   9      Davis     Mary       CMO      2
9  10  Rodriguez    Linda       CDO      1